{
    "Sākums": "Home",
    "Mans ceļš": "My path",
    "Mans ceļš no mājām uz": "My path from home to",
    "Latvijas Universitāti...": "University of Latvia...",
    "Mans stāsts": "My story",
    "Vietnes būtība": "About the site",
    "Sākumskola": "Primary school",
    "Datorspēles": "Computer games",
    "Vidusskola": "High school",
    "Kursi": "Courses",
    "Vaļasprieki": "Hobbies",
    "Universitāte": "University",
    "Sveiki!": "Hello!",
    "Mani sauc Ričards Ņedosvitnijs. Es esmu Latvijas Universitātes, Datorikas fakultātes 3. kursa students. ŠĪ vietne tika izstrādāta kursa “Tīmekļa dizaina pamati” ietvaros un tās nolūks ir sniegt vietnes viesiem saprast kā es savas dzīves gaitā kļuvu par Latvijas Universitātes, Datorikas fakultātes studentu, ar cerību kādu iedvesmot sekot savām vēlmēm un sasniegt to ko vienmēr ir vēlējies." :
        "My name is Ričards Ņedosvitnijs. I am a 3rd year student of the University of Latvia, Faculty of Computer Science. This site was developed as part of the Basics of Web Design course and aims to give visitors to understand how I became a student at the University of Latvia, Faculty of Computer Science, in the course of my life, hoping to inspire someone to follow their wishes and achieve what they have always wanted.",
    "Vietne sastāv no galvenās lapas un lapām, kas satur dzīves posmus, kas, manuprāt, vislabāk spēs reprezentēt manu garo ceļu līdz LU.  Vietne sastāv no 7 daļām – ievads un 6 galvenajiem dzīves posmiem, kas noveda pie šāda rezultāta. Pirms vietne tika izstrādāta, tai tika izveidota skice ,izmantojot lietotni – Figma. Kā mājaslapas ietvaru izmantoju – Laravel kopā ar JavaScript un SCSS tehnoloģijām.":
        "The site consists of a main page and pages that contain the stages of life that I think will best represent my long journey to LU. The site consists of 7 parts - an introduction and 6 main stages of life, which led to such a result. Before the site was developed, it was sketched using the app - Figma. I use Laravel as a website framework - together with JavaScript and SCSS technologies.",
    "Mājaslapu izstrādi es apguvu universitātē, bet joprojām ir tāls ceļš sevis pilnveidošanā un savu zināšanu uzlabošanā. Tiem, kam tiešām interesē ,šī vietnes satur, atstāju beigās savu svarīgāko dzīves atziņu, ko apguvu ejot šo ceļu, tāpēc aicinu pārskatīt visu līdz galam.":
        "I studied website development at university, but there is still a long way to go to improve myself and my knowledge. For those who are really interested in what this site contains, I leave at the end my most important life lesson I learned along this path, so I invite you to review everything to the end.",
    "Viens no svarīgākajiem posmiem dzīvē, manuprāt, ir izglītība un pārsvarā daudziem tieši tā sākas ar skolu. Manā gadījumā savu izglītību es uzsāku Rīgas 69. vidusskolā, kur es iepazinu daudzus cilvēkus, ieguvu daudz svarīgas un noderīgas zināšanas.":
        "One of the most important stages in life, in my opinion, is education, and for many, this is how school begins. In my case, I started my education at the 69th secondary school in Riga, where I met many people, gained a lot of important and useful knowledge.",
    "Viena no svarīgākajām iemaņām ko, manuprāt, ir jāapgūst katram ir socializācija, jo, iegūstot draugus, mācīšanās process kļūst ar vien patīkamāks un vieglāks. Galvenais neaizrauties ar to un neaizmirst arī par mājasdarbu veikšanu. Skolā es biju kluss un mierīgs, man nebija problēmu ar skolotājiem kā arī viņiem nebija problēmas ar mani.":
        "One of the most important skills that I think everyone needs to learn is socialization, because making friends makes the learning process more and more enjoyable and easier. The main thing is not to get excited about it and don't forget about doing homework. At school I was quiet and peaceful, I had no problems with teachers and they had no problems with me.",
    "Jau no pašas bērnības es sapratu, ka es negribu būt vislabākais, tāpēc arī necentos gūt augstākās atzīmes. Darīju visu pēc saviem spēkiem un mācījos to ko uzskatīju par interesantu, kaut arī man vecāki centās uzspiest gūt augstākos vērtējumus un salīdzināja tos ar maniem klasesbiedriem, bet es turpināju sekot savām domām un ticēju, ka es sasniegšu to ko es gribu, ja ieklausīšos ne tikai citu vēlmēs, bet arī savās.":
        "From a very early age, I realized that I did not want to be the best, so I did not try to get the highest marks. I did everything I could and learned what I found interesting, even though my parents tried to force me to get the highest marks and compared them to my classmates, but I kept following my thoughts and believing that I would achieve what I wanted if I listened not only in the desires of others, but also in my own.",
    "Datorspēles ļoti ietekmēja manu dzīvi, jo pateicoties tām man izdevās iegūt draugus, iemācīties angļu valodu un pats galvenais apgūt tehnoloģijas un gūt priekšstatu ko ar tām var darīt. Katra datorspēle manās acīs bija kā kāda jauna pasaule, kurā es varēju būt kāds vien es vēlējos.":
        "Computer games had a big impact on my life, because thanks to them I managed to make friends, learn English and most importantly learn technology and get an idea of what to do with it. Every computer game in my eyes was like a new world in which I could be whatever I wanted.",
    "Pirmā spēle, kuru es spēlēju un joprojām dažreiz atveru ir “RuneScape”. Kāpēc tieši šī? Jo tajā tu savu varoni vari attīstīt kā gribi, vari mainīt tā izskatu, vari trenēt dažādas iemaņas utt. Šeit es sāku saskatīt brīvību, realitātē cilvēki ir spiesti darboties un uzvesties pēc standartiem, piemēram, uzvesties un darīt to kā vecāki to vēlās, protams, tā arī vajadzētu būt, jo parasti vecāki vēlas, lai to bērns dzīvotu labāku dzīvi nekā viņi, kā arī būtu pieņemti sabiedrībā, tāpēc uzskatu, ka bērniem nav jāatņem iespēja spēlēt datorspēles, jo tieši tur bērns var iegūt pieredzi un brīvību, ko nevar iegūt reālā dzīvē.":
        "The first game I played and still open sometimes is RuneScape. Why this? Because in it you can develop your hero as you want, you can change its appearance, you can train different skills, etc. Here I began to see freedom, in reality people are forced to act and behave according to standards, such as behaving and doing as parents want it to be, of course, as it should be, because usually parents want their child to live a better life than they do, and should be accepted in society, so I believe that children should not be deprived of the opportunity to play computer games, because that is where the child can gain experience and freedom that cannot be gained in real life.",
    "Uzskatu, ka spēlējot datorspēles normas robežās bērns var gūt daudz priekšrocības – socializācijā, tehnoloģiju un valodu apgūšanā utt.":
        "I believe that by playing computer games within the norm, a child can gain many benefits - in socialization, learning technology and languages, and so on.",
    "Vidusskolas laikā lielākā daļa sāk domāt par savu nākotni un kādu karjeras ceļu tie vēlēsies iet. Dažādu iemeslu dēļ nomainīju skolu, ko es uzskatu par vienu no saviem labākajiem lēmumiem, jo pārejot uz Ziemeļvalstu ģimnāziju mans draugu loks stipri palielinājās.":
        "During high school, most people start thinking about their future and what career path they will want to take. For various reasons, I changed the school, which I consider to be one of my best decisions, as my circle of friends increased greatly when I moved to the Nordic Gymnasium.",
    "Vecajā skolā es jutos, ka mana attīstīšanās ir apstājusies un manu klases biedru intereses drastiski atšķīrās no manām. Nomainot skolu es iepazinu cilvēkus, kas domāja man līdzīgi un man atkal uzradās vēlme attīstīties, šeit es jau sapratu, ka gribu kļūt par programmētāju. Man klasē bija draugi, kas jau bija saskārušies ar programmēšanu, tāpēc man bija no kā mācīties. Man tik ļoti tas ieinteresēja, ka 10.klasē kā savu zinātniski pētnieciskā darba virzienu izvēlējos informātiku. Mana ZPD tēma bija dažādu operētājsistēmu drošības salīdzināšana, kura ietvaros centos uzlauzt tādas sistēmas kā Linux, Windows un MacOs, kas arī izdevās.":
        "In old school, I felt that my development had stopped and that the interests of my classmates were drastically different from mine. When I changed school, I met people who thought like me and I had a desire to develop again, here I already understood that I wanted to become a programmer. I had friends in the class who had already encountered programming, so I had something to learn from. I was so interested in it that in the 10th grade I chose computer science as my research direction. The topic of my ZPD was to compare the security of different operating systems, in which I tried to break into systems such as Linux, Windows and MacOs, which also succeeded.",
    "Tā kā es jau izdomāju, ka gribu būt programmētājs sāku vairāk mācīties fiziku, matemātiku, angļu valodu un informātiku, jo uzskatīju, ka tieši šie priekšmeti man palīdzēs iestāties universitātē, kur varēšu turpināt apgūt datoriku.":
        "Since I already thought that I wanted to be a programmer, I started learning more physics, mathematics, English and computer science, because I thought that these subjects would help me to enter a university where I could continue to study computer science.",
    "Arī mani vecāki sāka ievērot manu aizrautību ar tehnoloģijām, tāpēc piedāvāja man apmaksāt programmēšanas kursus. Vienojoties ar tēvu, izdomāju sākt apmeklēt programmēšanas kursus – “Progmeistars”.":
    "My parents also started to notice my passion for technology, so they offered me to pay for programming courses. In agreement with my father, I decided to start attending programming courses - \"Progmeistars\".",
    "Diemžēl visas latviešu grupas bija aizņemtas, tāpēc vajadzēja izvēlēties apmācību krievu valodā. Pats es māku runāt krievu valodā, bet nemācēju lasīt un sākumā tas man sastādīja daudz grūtību, es nespēju turēt līdzi saviem biedriem, jo nevarēja kārtīgi saprast uzdevuma nosacījumus. Ar laiku viss kļuva labāk, es iemācījos raiti lasīt krievu valodā un beidzot varēju piedalīties nodarbību diskusijās un pilnveidot savas programmēšanas zināšanas. Kursos es apguvu aizvēsturisko programmēšanas valodu – Pascal. Šī valoda bija piemērota iesācējiem, jo sintakse bija viegli saprotama.":
        "Unfortunately, all Latvian groups were busy, so they had to choose training in Russian. I can speak Russian myself, but I can't read and at first it was a lot of trouble for me, I couldn't keep up with my members because I couldn't understand the conditions of the task properly. Over time, things got better, I learned to read fluently in Russian and finally was able to participate in class discussions and improve my programming skills. In the courses I learned the prehistoric programming language - Pascal. This language was suitable for beginners because the syntax was easy to understand.",
    "Pabeidzot šos kursus, es guvu plašu ieskatu programmēšana, problēmu risināšanā kā arī iemācījos lasīt krievu valodā. Es silti ieteiktu programmēšanas bāzi mācīties tieši kaut kādos kursos, jo tieši iemācoties kvalitatīvi bāzi cilvēks spēs attīstīt savas spējas patstāvīgi daudz kvalitatīvāk un ātrāk.":
        "After completing these courses, I gained extensive insight into programming, problem solving, and learned to read in Russian. I would strongly recommend learning the programming base in some kind of course, because by learning the basics qualitatively, a person will be able to develop his / her abilities independently much more qualitatively and faster.",
    "Kamēr vēl apmeklēju programmēšanas kursus, es vēl mācījos skolā un man bija pietiekami daudz brīvā laika. Tā kā skolā man bija klasesbiedri, kas arī mācījās programmēt ārpus skolas laika mēs bieži mēdzām savākties pie kāda un kopistiski kaut ko veidot, pārsvarā tās bija parastas programmas, kas mums atviegloja dzīvi, piemēram, ieslēdzot datoru atvērās mums vajadzīgās programmas, veidojām kalkulatoru, kas mums likās stipri ērtāks nekā tos ko lietojām, utml.":
        "While still attending programming courses, I was still in school and had enough free time. Since I had classmates at school who also learned to program outside of school, we often used to gather with someone and create something co-operative, mostly ordinary programs that made life easier for us, for example, when we turned on the computer, we opened the programs we needed. we found it much more comfortable than the ones we used, etc.",
    "Skolā arī mēdzām muļķot mūsu klasesbiedrus, izveidojot programmas, kuras izslēdz datoru informātikas kabinetā, ja to atver. Šīs programmas mēs pārsaucām un nomainījām to ikonas, kopējot populāro pārlūkprogrammu izskatu. Tādā veidā arī visi uzķērās, jo centās atvērt Google Chrome, bet tā vietā dators izslēdzās.":
        "At school, we also used to fool our classmates by creating programs that turn off the computer in the computer room if it is opened. We renamed these programs and changed their icons, copying the look of popular browsers. That's how everyone got stuck trying to open Google Chrome, but turned off the computer instead.",
    "Darot visas šādas muļķības, mēs daudz ko jaunu iemācījāmies, tad es arī sāku iepazīt Windows operētājsistēmas strādāšanas principus un iemācījos vairākas komandas, kas joprojām man ir noderīgas strādājot pie datora. Uzskatu, ka pat arī muļķīgas darbības dažreiz var novest pie pozitīva rezultāta.":
        "By doing all this nonsense, we learned a lot of new things, then I also started to learn how the Windows operating system works and learned several commands that are still useful to me when working on a computer. I believe that even stupid actions can sometimes lead to a positive result.",
    "Beidzot arī es pabeidzu vidusskolu un bija pienācis laiks pieteikties studijām. Es zināju, ka vienīgais ko gribu studēt ir datorzinātnes, tāpēc meklēju universitātes, kas to piedāvā. Izvēle man bija liela – RTU, LU, LLU vai TSI. Pieteicos uz visām, bet kā pirmo ieliku Latvijas Universitātes Datorikas fakultāti, jo man piedāvātā programma vislabāk patika, jo tā sevī iekļāva praksi, kas man likās ļoti svarīga.":
        "I finally finished high school and it was time to apply. I knew that the only thing I wanted to study was computer science, so I'm looking for universities that offer it. The choice was great for me - RTU, LU, LLU or TTI. I applied to everyone, but I was the first to join the Faculty of Computer Science of the University of Latvia, because I liked the program I offered the best, because it included an internship that seemed very important to me.",
    "Iestāšanās bija smaga, jo diemžēl eksāmenos neieguvu tos spožākos rezultātus, tāpēc knapi tiku pie budžeta vietas, bet tiekot es sapratu, ka tā ir zīme, ka eju pa pareizo ceļu! Studējot universitātē es iepazinu daudz jaunus cilvēkus ar kuriem man sakrita intereses, ieguvu draugus un guvu priekšstatu par IT noviržu dažādību un varēju pieskarties un pamēģināt katru.":
        "It was difficult to enter, because unfortunately I did not get the brightest results in the exams, so I barely got to the budget place, but upon meeting I realized that it is a sign that I am on the right track! While studying at university, I met a lot of young people with whom I shared interests, made friends and got an idea of the diversity of IT deviations, and was able to touch and try each one.",
    "Universitāti es uzskatu kā vietu, kur tu vari vairāk izprast sevi pamēģinot dažādos priekšmetus un saprast uz ko vēlies specializēties, nav galvenais būt gudram, bet galvenais ir vēlme mācīties un izprast to, kas tev patīk ar to varēs sasniegt to ko tu gribi. Pateicoties praksei es arī ieguvu savu sapņu darbu – programmētājs.":
        "I see university as a place where you can better understand yourself by trying different subjects and understand what you want to specialize in. The main thing is not to be smart, but the main thing is to learn and understand what you like. Thanks to practice, I also got my dream job - a programmer."
}
